alert("You are Ready for Test then please click on Ok button");
let data=[
    {
        Q:" 1. यदि RATE को एक कोड के रूप में  181205 लिखा जाता है , तो KEY   के लिए कोड क्या होगा ? ",
        a:"(a) 182014",
        b:"(b) 192114",
        c:"(c) 182115",
        d:"(d) 182114",
        ans:"ans3"
    },
    {
        Q:" 2.यदि WAIT को एक कोड के रूप में  231920 लिखा जाता है , तो RUN  के लिए कोड क्या होगा? ",
        a:"(a) 11523",
        b:"(b) 11814",
        c:"(c) 11924",
        d:"(d) 11525", 
        ans:"ans1"
    },
    {
        Q:" 3.यदि C=24, EYES=46,  तो FOX क्या है? ",
        a:"(a) 38",
        b:"(b) 35",
        c:"(c) 40",
        d:"(d) 36", 
        ans:"ans1"
    },
    {
        Q:" 4.कूटभाषा में , EARN को  4073 के रूप में लिखा जाता है | LIGHT के लिए कोड क्या होगा ?",
        a:"(a) 18670",
        b:"(b) 19679",
        c:"(c) 18679",
        d:"(d) 18671", 
        ans:"ans1"
    },
    {
        Q:" 5.यदि ATM को एक कोड के रूप 20113  में  लिखा जाता है , तो GRIND के लिए कोड क्या होगा?",
        a:"(a) 6189144",
        b:"(b) 7189154",
        c:"(c) 7189144",
        d:"(d) 7199144", 
        ans:"ans1"
    },
     {
        Q:"6.कूट भाषा में , यदि NEAT को 145120 रूप में लिखा जाता है,  तो  TREAT को क्या लिखा जाएगा? ",
        a:"(a) 20195121",
        b:"(b) 20185121",
        c:"(c) 20195120",
        d:"(d) 20185120", 
        ans:"ans1"
    },
    {
        Q:"7.यदि  PICTURE को 6 के रूप में लिखा जाता है एवं  STUDIO को  5 के रूप में लिखा जाता है तो  TELEVISION  का कोड क्या होगा? ",
        a:"(a) 6",
        b:"(b) 9",
        c:"(c) 8",
        d:"(d) 7", 
        ans:"ans1"
    },
    {
        Q:"8.यदि  KAVITA को  1626518726  लिखा  जाता है ,तो इसी कोड में  RISHA क्या लिखा जाएगा?",
        a:"(a) 91134258",
        b:"(b) 91881918",
        c:"(c) 91211273",
        d:"(d) 91881633", 
        ans:"ans1"
    },
    {
        Q:"9.कूट भाषा में , NEAT को 3409 रूप में लिखा जाता है | LEARN के लिए कोड क्या है ? ",
        a:"(a) 14073",
        b:"(b) 14072",
        c:"(c) 14084",
        d:"(d) 14083", 
        ans:"ans1"
    },
    {
        Q:"10.किसी विशिष्ट कूट भाषा में यदि ZEBU: 4371,FUZE : 9143 है| तो BINE का कोड क्या होगा?",
        a:"(a) 7836",
        b:"(b) 7863",
        c:"(c) 7869",
        d:"(d) 4863", 
        ans:"ans1"
    },
    {
        Q:"11.कूट भाषा में TEMPT को  72214117 के रूप में लिखा जाता है | RESULT के लिए कोड क्या है? ",
        a:"(a) 92286147",
        b:"(b) 92286156",
        c:"(c) 92276157",
        d:"(d) 92286157", 
        ans:"ans1"
    },
    {
        Q:"12.यदि किसी भाषा में , 'CODE'  को  '31545' के रूप में लिखा जाता है 'FEAR'  तब आप  को कैसे लिखेंगे? ",
        a:"(a) 62218",
        b:"(b) 18156",
        c:"(c) 651189",
        d:"(d) 651178", 
        ans:"ans4"
    },
    {
        Q:"13.आदि PIPE को  169165 लिखा जाता है तो  SWAN का अंतिम कोड क्या होगा? ",
        a:"(a) 3",
        b:"(b) 4",
        c:"(c) 6",
        d:"(d) 5", 
        ans:"ans4"
    },
    {
        Q:"14.यदि EAT को  7322 के रूप में लिखा जाता है ,तो URN के लिए कोड क्या होगा ",
        a:"(a) 232116",
        b:"(b) 232015",
        c:"(c) 222016",
        d:"(d) 232016", 
        ans:"ans1"
    },
    {
        Q:"15.यदि POT को 151419 लिखा जाता है,तो  OUTGHT के लिए कोड क्या है? ",
        a:"(a) 14206719",
        b:"(b) 14206721",
        c:"(c) 14206718",
        d:"(d) 14205719", 
        ans:"ans4"
    },
    {
        Q:"16. यदि FOUR को  6518 लिखा जाता है तो  WIND के लिए कोड क्या है? ",
        a:"(a) 3054",
        b:"(b) 3044",
        c:"(c) 3944",
        d:"(d) 3957", 
        ans:"ans4"
    },
    {
        Q:"17. यदि LIME को एक कोड के रूप में 129135 लिखा जाता है, तो ORANGE  के लिए कोड क्या होगा? ",
        a:"(a) 151811476",
        b:"(b) 151811475",
        c:"(c) 151812575",
        d:"(d) 151911475", 
        ans:"ans4"
    },
    {
        Q:"18. कूटभाषा में , BEAJ को 1409 के रूप में लिखा जाता है | HIGH के लिए कोड क्या होगा? ",
        a:"(a) 7687",
        b:"(b) 8768",
        c:"(c) 7876",
        d:"(d) 6766", 
        ans:"ans3"
    },
    {
        Q:"19. कूटभाषा में ,YELl  को  2551222 के रूप में लिखा जाता है | इसी भाषा में के  TALE  लिए कोड क्या है? ",
        a:"(a) 201126",
        b:"(b) 211123",
        c:"(c) 201135",
        d:"(d) 201125", 
        ans:"ans2"
    },
    {
        Q:"20. P का पुत्र कौन है ? ",
        a:"(a) दिए गए विकल्प में से कोई नहीं ",
        b:"(b) R ",
        c:"(c) Q",
        d:"(d) T", 
        ans:"ans2"
    },
]
const question=document.querySelector(".question");
const option1=document.querySelector("#option1");
const option2=document.querySelector("#option2");
const option3=document.querySelector("#option3");
const option4=document.querySelector("#option4");
const submit=document.querySelector("#submit");
const answers=document.querySelectorAll('.answer');
const Showscore=document.querySelector("#showscore ");
 
let questionCount=0;
let Score=0;
const loadquestion =() =>{
    question.innerHTML=data[questionCount].Q;
    option1.innerHTML=data[questionCount].a;
    option2.innerHTML=data[questionCount].b;
    option3.innerHTML=data[questionCount].c;
    option4.innerHTML=data[questionCount].d;
}
const getCheckAnswer = () =>{
    let answer;

    answers.forEach((curAnselem)=>{
        if(curAnselem.checked){
            answer=curAnselem.id;
        }
    });
    return answer;
};
const deselectAll = () =>{
    answers.forEach((curAnselem)=>curAnselem.checked=false);
}
submit.addEventListener('click',()=>{
    const checkedAnswer=getCheckAnswer()
    console.log(checkedAnswer);
    if(checkedAnswer==data[questionCount].ans){
      Score++;                     
    };
    questionCount++;
    deselectAll();
    if(questionCount<data.length){
        loadquestion();
    }else {
        Showscore.innerHTML = `
            <h3>Congratulations your Score : ${Score}/${data.length} <span class="icon"> 🎉<span> </h3>

        `;
      
    }
});
loadquestion();